########################################################################################################################################
# คำตอบ
response_thai = {
    "greetings_responses": ["สวัสดีครับ!"],
    "goodbyes_responses": ["บายครับ!", "ลาก่อนครับ!"],
    "name_responses": ["ฉันชื่อ Chatbot!"],
    "who_responses": ["ฉันคือ Chatbot V0.1!"],
    "MLis_responses": ["เป็นการศึกษาอัลกอริทึมของคอมพิวเตอร์ที่มีการพัฒนา การเรียนรู้ของเครื่องถูกมองว่าเป็นส่วนหนึ่งของปัญญาประดิษฐ์ โดยอัลกอริทึมสร้างแบบจำลองทางคณิตศาสตร์จากข้อมูลตัวอย่าง (เรียกว่า ข้อมูลสอน) เพื่อที่จะคาดการณ์หรือตัดสินใจได้อย่างชัดเจน"],
    "MLcando_responses" : ["Machine learning (การเรียนรู้ของเครื่อง) เป็นสาขาหนึ่งของปัญญาประดิษฐ์ที่ใช้วิธีการคณิตศาสตร์เพื่อให้คอมพิวเตอร์สามารถเรียนรู้จากข้อมูลและปรับปรุงความสามารถในการทำงานตามข้อมูลที่มีอยู่นี่คือบางอย่างที่เครื่องมือเรียนรู้ (machine learning) สามารถทำได้: \n1.  การจำแนก (Classification) \n2.  การทำนาย (Prediction): \n3.  การค้นหาความสัมพันธ์ (Regression) \n4.  การจัดกลุ่ม (Clustering) \n5.  การลดมิติ (Dimensionality Reduction) \n6.  การสร้างโมเดลแนะนำ (Recommendation) \n7.  การปรับปรุงโมเดล (Model Tuning) \n8.  การตรวจจับความผิดปกติ (Anomaly Detection) \n9.  การประมวลผลข้อมูลที่มีลำดับเวลา (Time Series Analysis) \n10. การเรียนรู้โครงสร้างข้อมูล (Structured Learning) \n11. การปรับปรุงการตัดสินใจ (Reinforcement Learning) \n12. การวิเคราะห์ภาพและวิดีโอ (Image and Video Analysis) \n13. การปรับปรุงประสิทธิภาพการเรียนรู้ (Transfer Learning) \n14. การรวมข้อมูลและข้อมูลแบบหลายแหล่ง (Ensemble Learning)"],
    "NOTGateis_responses": ["เป็นเกตที่ให้ค่าตรงกันข้ามกับค่า input ที่ใส่เข้าไปเสมอ"],
    "ANDGateis_responses": ["เป็นเกตที่ให้ค่า bit 0 ถ้ามีค่า input ใดๆเป็น 0 และให้ค่า 1 ถ้า input ทั้งหมดเป็น 1"],
    "ORGateis_responses": ["เป็นเกตที่ให้ค่า 1 เสมอถ้ามี input ใดๆเป็น 1 และให้ค่า 0 ถ้าไม่มีตัวใดเป็น 1 เลย"],
    "NANDGateis_responses": ["เป็นเกตที่ตรงกันข้ามกับ AND คือ ถ้ามี Input ใดๆเป็น 0 จะให้ค่า 1 และถ้า input เป็น 1 ทั้งหมดจะให้ค่า 0"],
    "NORGateis_responses": ["เป็นเกตที่ตรงกันข้ามกับ OR คือ ถ้ามี Input ใดๆเป็น 1 จะให้ค่า 0 และถ้า input เป็น 0 ทั้งหมดจะให้ค่า 1"],
    "XORGateis_responses": ["หรือเรียกว่า Exclusive OR เป็นเกตที่ถ้า Input แตกต่างกันจะให้ค่า 1 และถ้า Input เหมือนกันจะให้ค่า 0"],
    "XNORGateis_responses": ["เป็นเกตที่ตรงกันข้ามกับ XOR คือ ถ้า Input แตกต่างกันจะให้ค่า 0 และถ้า Input เหมือนกันจะให้ค่า 1"],
}